In [ ]:
# Questions 1: 1050. Actors and Directors Who Cooperated At Least Three Times
```SQL
SELECT actor_id, director_id
FROM ActorDirector
GROUP BY actor_id, director_id
HAVING COUNT(*) >= 3

In [ ]:
# Questions 2: 1667. Fix Names in a Table
```SQL
# Write your MySQL query statement below
# task to make the first character as uppercase and rest as lower and order by user_id ascending
select user_id, concat(UPPER(substring(name,1,1))
,LOWER(substring(name,2))) as name
from Users
ORDER BY user_id ASC

In [ ]:
# Question 3: 175. Combine Two Tables
```SQL
# Write your MySQL query statement below
SELECT firstName, lastName, city, state
FROM Person as p
LEFT JOIN Address as a
ON p.personId = a.personId

In [ ]:
# Question 4: 176. Second Highest Salary
```SQL
# Need to find the second highest salary
SELECT IFNULL(
(SELECT Salary
FROM Employee
GROUP BY salary
ORDER BY Salary DESC
LIMIT 1 OFFSET 1), NULL) as SecondHighestSalary

In [ ]:
# Question 5: 1327. List the Products Ordered in a Period
```SQL
SELECT P.product_name, sum(O.unit) as unit
FROM Products as p
JOIN Orders as O
ON p.product_id = O.product_id
WHERE O.order_date >= '2020-02-01'
and O.order_date < '2020-03-01'
GROUP BY P.product_id, P.product_name
HAVING sum(O.unit) >= 100

In [ ]:
# Question 6: 1378. Replace Employee ID With The Unique Identifier
```SQL
SELECT euni.unique_id, e.name
FROM Employees as e
LEFT JOIN EmployeeUNI as euni
ON e.id = euni.id

In [ ]:
# Question 7: 550. Game Play Analysis IV
```SQL
# -- first need to people that logged in today distinct
# -- then the same people that logged in tomorrow
# -- of the short listed people
# -- divided them by the total player
# -- round it to two decimal

WITH first_login AS (
  SELECT player_id, MIN(event_date) AS first_date
  FROM Activity
  GROUP BY player_id
)
SELECT ROUND(
  AVG(CASE WHEN a2.player_id IS NOT NULL THEN 1 ELSE 0 END)
, 2) AS fraction
FROM first_login fl
LEFT JOIN Activity a2
  ON a2.player_id = fl.player_id
 AND a2.event_date = DATE_ADD(fl.first_date, INTERVAL 1 DAY);

In [ ]:
# Question 8: 1075. Project Employees I
```SQL
SELECT project_id, round(avg(experience_years),2) as average_years
FROM Project p
JOIN Employee e
ON p.employee_id = e.employee_id
GROUP BY p.project_id

In [ ]:
# Question 9: 185. Department Top Three Salaries
```SQL
WITH ranked AS (
  SELECT
    e.*,
    DENSE_RANK() OVER (
      PARTITION BY e.departmentId
      ORDER BY e.salary DESC
    ) AS rnk
  FROM Employee e
)
SELECT
  d.name  AS Department,
  ranked.name AS Employee,
  ranked.salary AS Salary
FROM ranked
JOIN Department d ON d.id = ranked.departmentId
WHERE ranked.rnk <= 3
ORDER BY Department, Salary DESC, Employee;